In [77]:
# inmport Data Manipulation Library
import pandas as pd
import numpy as np

In [78]:
# Definea series : 1D Array

a = pd.Series([1,2,3,4,5])
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [79]:
b = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
b

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [80]:
# Using Concep of Indexing
print(a.dtype)
print(a[3])
print(b['d'])

int64
4
4

In [81]:
import pandas as pd

c = pd.DataFrame({'India': [2000], 'USA': [3000], 'UK': [30000]})
print(c)

   India   USA     UK
0   2000  3000  30000

In [82]:

import pandas as pd

database = {
    'Name': ['Nikhil','Aniket','Mihir','Tanvi','Hemangi'],  # Added empty string to match lengths
    'Age': [10, 11, 12, 13, 14],
    'Marks': [34, 56, 67, 34, 56],
    'CGPA': [8, 6, 9, 6, 8] # have to add Salary
}

# create a variable df to store the DataFrame
df = pd.DataFrame(database)

print(df)

      Name  Age  Marks  CGPA
0   Nikhil   10     34     8
1   Aniket   11     56     6
2    Mihir   12     67     9
3    Tanvi   13     34     6
4  Hemangi   14     56     8

In [83]:
df

      Name  Age  Marks  CGPA
0   Nikhil   10     34     8
1   Aniket   11     56     6
2    Mihir   12     67     9
3    Tanvi   13     34     6
4  Hemangi   14     56     8

In [84]:
df[df['Name'] == 'Mihir']

    Name  Age  Marks  CGPA
2  Mihir   12     67     9

In [85]:
df[df['Name'] == 'Tanvi']

    Name  Age  Marks  CGPA
3  Tanvi   13     34     6

In [86]:
# Using agg( : Aggregate Funcation)
df['Marks'].agg(['min','max','mean'])

min     34.0
max     67.0
mean    49.4
Name: Marks, dtype: float64

In [87]:
df[df['Marks'] == 67]

    Name  Age  Marks  CGPA
2  Mihir   12     67     9

In [88]:
df[df['CGPA'] == 6]

     Name  Age  Marks  CGPA
1  Aniket   11     56     6
3   Tanvi   13     34     6

In [89]:
df[df['CGPA'] == 8]

      Name  Age  Marks  CGPA
0   Nikhil   10     34     8
4  Hemangi   14     56     8

In [90]:
# Checking Dataframe Information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Marks   5 non-null      int64
 3   CGPA    5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [91]:
df.isnull().sum()

Name     0
Age      0
Marks    0
CGPA     0
dtype: int64

In [92]:
print(df['Marks'].sum())
print(df['Marks'].mean())
print(df['Marks'].max())
print(df['Marks'].min())
print(df['Marks'].nunique())
print(df['Marks'].unique())
print(df['Name'].value_counts())
print(df['Marks'].value_counts())

247
49.4
67
34
3
[34 56 67]
Name
Nikhil     1
Aniket     1
Mihir      1
Tanvi      1
Hemangi    1
Name: count, dtype: int64
Marks
34    2
56    2
67    1
Name: count, dtype: int64

In [93]:



Company = {
    'Name': ['Nikhil','Aniket','Mihir','Tanvi','Hemangi','Ajay','Disha','Tosif'],  # Added empty string to match lengths
    'Age': [24, 26, 28, 30, 32, 34, 36, 38],
    'Salary': [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000],
    'No_of_Experience': [1, 2, 3, 4, 5, 6, 7, 8] ,
    'Domain':['Tech','NonTech','R&D','HR','Tech','Tech','NonTech','Tech'],
    'Gender':['Male','Male','Male','Female','Female','Male','Female','Male'],
}

# create a variable df to store the DataFrame
df = pd.DataFrame(Company)

print(df)

      Name  Age  Salary  No_of_Experience   Domain  Gender
0   Nikhil   24    1000                 1     Tech    Male
1   Aniket   26    2000                 2  NonTech    Male
2    Mihir   28    3000                 3      R&D    Male
3    Tanvi   30    4000                 4       HR  Female
4  Hemangi   32    5000                 5     Tech  Female
5     Ajay   34    6000                 6     Tech    Male
6    Disha   36    7000                 7  NonTech  Female
7    Tosif   38    8000                 8     Tech    Male

In [94]:
df.info() # checking information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              8 non-null      object
 1   Age               8 non-null      int64
 2   Salary            8 non-null      int64
 3   No_of_Experience  8 non-null      int64
 4   Domain            8 non-null      object
 5   Gender            8 non-null      object
dtypes: int64(3), object(3)
memory usage: 516.0+ bytes

In [95]:
# Evaluating The Maximum no.of Experience
print(df['No_of_Experience'].max())

8

In [96]:
df['No_of_Experience'].min()

1

In [97]:
df['No_of_Experience'].mean()

4.5

In [98]:
df['No_of_Experience'].mean()

4.5

In [105]:

df[df['Gender'] == 'Male'].max()

Name                Tosif
Age                    38
Salary               8000
No_of_Experience        8
Domain               Tech
Gender               Male
dtype: object

In [112]:

df[df['Gender'] == 'Female'].max()

Name                 Tanvi
Age                     36
Salary                7000
No_of_Experience         7
Domain                Tech
Gender              Female
dtype: object

In [114]:

F = df[df['Gender'] == 'Female'] 
F

      Name  Age  Salary  No_of_Experience   Domain  Gender
3    Tanvi   30    4000                 4       HR  Female
4  Hemangi   32    5000                 5     Tech  Female
6    Disha   36    7000                 7  NonTech  Female

In [107]:
df['Salary'].max()

8000

In [111]:
F[F['Salary'] == F['Salary'].max()]

    Name  Age  Salary  No_of_Experience   Domain  Gender
6  Disha   36    7000                 7  NonTech  Female

In [102]:
df['Gender'].value_counts()

Gender
Male      5
Female    3
Name: count, dtype: int64